[Killed] BlockStatement
src/middleware/auth.ts:12:87
   }
 }
 
-export function authMiddleware(req: Request, res: Response, next: NextFunction): void {
-  const authHeader = req.headers.authorization;
-  if (!authHeader || !authHeader.startsWith('Bearer ')) {
-    res.status(401).json({ error: 'Access token required.' });
-    return;
-  }
-
-  try {
-    const token = authHeader.split(' ')[1];
-    const payload = verifyAccessToken(token);
-    req.teacher = payload;
-    next();
-  } catch {
-    res.status(401).json({ error: 'Invalid or expired access token.' });
-  }
-}
+export function authMiddleware(req: Request, res: Response, next: NextFunction): void {}
 
 export function principalOnly(req: Request, res: Response, next: NextFunction): void {
killedBy: Course API Routes GET /api/courses returns 401 without auth token
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
src/middleware/auth.ts:14:23
 
 export function authMiddleware(req: Request, res: Response, next: NextFunction): void {
   const authHeader = req.headers.authorization;
-  if (!authHeader || !authHeader.startsWith('Bearer ')) {
+  if (!authHeader || !authHeader.endsWith('Bearer ')) {
     res.status(401).json({ error: 'Access token required.' });
     return;
killedBy: Attendance API Routes GET /api/courses/:courseId/attendance returns attendance records
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/middleware/auth.ts:14:22
 
 export function authMiddleware(req: Request, res: Response, next: NextFunction): void {
   const authHeader = req.headers.authorization;
-  if (!authHeader || !authHeader.startsWith('Bearer ')) {
+  if (!authHeader || authHeader.startsWith('Bearer ')) {
     res.status(401).json({ error: 'Access token required.' });
     return;
killedBy: Course API Routes GET /api/courses returns courses for authenticated teacher
statusReason: expected 401 to be 200 // Object.is equality

[Timeout] BlockStatement
src/middleware/auth.ts:19:7
     return;
   }
 
-  try {
-    const token = authHeader.split(' ')[1];
-    const payload = verifyAccessToken(token);
-    req.teacher = payload;
-    next();
-  } catch {
+  try {} catch {
     res.status(401).json({ error: 'Invalid or expired access token.' });
   }

[Timeout] BlockStatement
src/middleware/auth.ts:24:11
     const payload = verifyAccessToken(token);
     req.teacher = payload;
     next();
-  } catch {
-    res.status(401).json({ error: 'Invalid or expired access token.' });
-  }
+  } catch {}
 }
 

[Killed] ObjectLiteral
src/middleware/auth.ts:25:26
     req.teacher = payload;
     next();
   } catch {
-    res.status(401).json({ error: 'Invalid or expired access token.' });
+    res.status(401).json({});
   }
 }
killedBy: authMiddleware returns 401 when token is invalid
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   {

[Timeout] BlockStatement
src/middleware/auth.ts:29:86
   }
 }
 
-export function principalOnly(req: Request, res: Response, next: NextFunction): void {
-  if (!req.teacher || req.teacher.role !== 'principal') {
-    res.status(403).json({ error: 'Only principals can perform this action.' });
-    return;
-  }
-  next();
-}
+export function principalOnly(req: Request, res: Response, next: NextFunction): void {}
 

[Killed] ConditionalExpression
src/middleware/auth.ts:30:7
 }
 
 export function principalOnly(req: Request, res: Response, next: NextFunction): void {
-  if (!req.teacher || req.teacher.role !== 'principal') {
+  if (true) {
     res.status(403).json({ error: 'Only principals can perform this action.' });
     return;
killedBy: Course API Routes POST /api/courses returns 400 when required fields are missing
statusReason: expected 403 to be 400 // Object.is equality

[Killed] EqualityOperator
src/middleware/auth.ts:30:23
 }
 
 export function principalOnly(req: Request, res: Response, next: NextFunction): void {
-  if (!req.teacher || req.teacher.role !== 'principal') {
+  if (!req.teacher || req.teacher.role === 'principal') {
     res.status(403).json({ error: 'Only principals can perform this action.' });
     return;
killedBy: Course API Routes POST /api/courses returns 400 when required fields are missing
statusReason: expected 403 to be 400 // Object.is equality
