[Survived] ObjectLiteral
src/utils/jwt.ts:14:52
 }
 
 export function signRefreshToken(payload: TokenPayload): string {
-  return jwt.sign(payload, env.JWT_REFRESH_SECRET, { expiresIn: env.REFRESH_TOKEN_EXPIRY as any });
+  return jwt.sign(payload, env.JWT_REFRESH_SECRET, {});
 }
 
